app/views/keywords/index.html.erb

SELECT  "sleeps".* FROM "sleeps"   ORDER BY "sleeps"."id" ASC LIMIT 1
---

<%= link_to "Edit Sleep Period", edit_sleep_path(Sleep.first), class: "btn-submit"%>