app/controllers/keywords_controller.rb

SELECT "keywords".* FROM "keywords"
---
	def index
    @keywords = Keyword.all