app/controllers/sleep_controller.rb

	def show
	  @sleep = Sleep.first
---
SELECT  "sleeps".* FROM "sleeps"   ORDER BY "sleeps"."id" ASC LIMIT 1